#pragma once

#include <inttypes.h>

#include <array>
#include <memory>
#include <phosg/Encoding.hh>
#include <phosg/JSON.hh>
#include <random>
#include <string>
#include <vector>

#include "BattleParamsIndex.hh"
#include "CommonFileFormats.hh"
#include "PSOEncryption.hh"
#include "StaticGameData.hh"
#include "Text.hh"

////////////////////////////////////////////////////////////////////////////////
// Game structures (used in 6x6B/6x6C/6x6E handlers, and here)

struct SyncEnemyStateEntry {
  le_uint32_t flags = 0; // Same as flags in 6x0A
  le_uint16_t item_drop_id = 0;
  le_uint16_t total_damage = 0; // Same as in 6x0A
  uint8_t red_buff_type = 0;
  uint8_t red_buff_level = 0;
  uint8_t blue_buff_type = 0;
  uint8_t blue_buff_level = 0;
} __packed_ws__(SyncEnemyStateEntry, 0x0C);

struct SyncObjectStateEntry {
  le_uint16_t flags = 0;
  le_uint16_t item_drop_id = 0;
} __packed_ws__(SyncObjectStateEntry, 0x04);

////////////////////////////////////////////////////////////////////////////////
// Set data table (variations index)

struct Variations {
  struct Entry {
    le_uint32_t layout = 0;
    le_uint32_t entities = 0;
  } __packed_ws__(Entry, 0x08);
  parray<Entry, 0x10> entries;

  std::string str() const;
  phosg::JSON json() const;
} __packed_ws__(Variations, 0x80);

class SetDataTableBase {
public:
  virtual ~SetDataTableBase() = default;

  Variations generate_variations(
      Episode episode,
      bool is_solo,
      std::shared_ptr<PSOLFGEncryption> opt_rand_crypt = nullptr) const;
  virtual Variations::Entry num_available_variations_for_floor(Episode episode, uint8_t floor) const = 0;
  virtual Variations::Entry num_free_play_variations_for_floor(Episode episode, bool is_solo, uint8_t floor) const = 0;

  enum class FilenameType {
    OBJECT_SETS = 0,
    ENEMY_SETS,
    EVENTS,
  };

  virtual std::string map_filename_for_variation(
      Episode episode, GameMode mode, uint8_t floor, uint32_t layout, uint32_t entities, FilenameType type) const = 0;
  std::vector<std::string> map_filenames_for_variations(
      Episode episode, GameMode mode, const Variations& variations, FilenameType type) const;

  uint8_t default_area_for_floor(Episode episode, uint8_t floor) const;

protected:
  explicit SetDataTableBase(Version version);

  Version version;
};

class SetDataTable : public SetDataTableBase {
public:
  struct SetEntry {
    std::string object_list_basename;
    std::string enemy_and_event_list_basename;
    std::string area_setup_filename;
  };

  SetDataTable(Version version, const std::string& data);
  virtual ~SetDataTable() = default;

  virtual Variations::Entry num_available_variations_for_floor(Episode episode, uint8_t floor) const;
  virtual Variations::Entry num_free_play_variations_for_floor(Episode episode, bool is_solo, uint8_t floor) const;
  virtual std::string map_filename_for_variation(
      Episode episode, GameMode mode, uint8_t floor, uint32_t layout, uint32_t entities, FilenameType type) const;

  std::string str() const;

private:
  template <bool BE>
  void load_table_t(const std::string& data);

  // Indexes are [floor][variation1][variation2]
  // floor is cumulative per episode, so Ep2 starts at floor=18.
  std::vector<std::vector<std::vector<SetEntry>>> entries;
};

class SetDataTableDCNTE : public SetDataTableBase {
public:
  SetDataTableDCNTE();
  virtual ~SetDataTableDCNTE() = default;

  virtual Variations::Entry num_available_variations_for_floor(Episode episode, uint8_t floor) const;
  virtual Variations::Entry num_free_play_variations_for_floor(Episode episode, bool is_solo, uint8_t floor) const;
  virtual std::string map_filename_for_variation(
      Episode episode, GameMode mode, uint8_t floor, uint32_t layout, uint32_t entities, FilenameType type) const;

private:
  static const std::array<std::vector<std::vector<std::string>>, 0x12> NAMES;
};

class SetDataTableDC112000 : public SetDataTableBase {
public:
  SetDataTableDC112000();
  virtual ~SetDataTableDC112000() = default;

  virtual Variations::Entry num_available_variations_for_floor(Episode episode, uint8_t floor) const;
  virtual Variations::Entry num_free_play_variations_for_floor(Episode episode, bool is_solo, uint8_t floor) const;
  virtual std::string map_filename_for_variation(
      Episode episode, GameMode mode, uint8_t floor, uint32_t layout, uint32_t entities, FilenameType type) const;

private:
  static const std::array<std::vector<std::vector<std::string>>, 0x12> NAMES;
};

////////////////////////////////////////////////////////////////////////////////
// Map (DAT) file parser. This class is responsible for parsing individual
// quest DAT files, or up to three individual free-play DAT files (object sets,
// enemy sets, and events, each of which are optional). In the free-play case,
// the MapFile represents entities for a single floor; in the quest case, it
// represents the lists for all floors.

class MapFile : public std::enable_shared_from_this<MapFile> {
public:
  static const char* name_for_object_type(uint16_t type);
  static const char* name_for_enemy_type(uint16_t type);

  struct SectionHeader { // Only used for quest DAT files
    enum class Type {
      END = 0,
      OBJECT_SETS = 1,
      ENEMY_SETS = 2,
      EVENTS = 3,
      RANDOM_ENEMY_LOCATIONS = 4,
      RANDOM_ENEMY_DEFINITIONS = 5,
    };
    le_uint32_t le_type;
    le_uint32_t section_size; // Includes this header
    le_uint32_t floor;
    le_uint32_t data_size;

    inline Type type() const {
      return static_cast<Type>(this->le_type.load());
    }
  } __packed_ws__(SectionHeader, 0x10);

  struct ObjectSetEntry { // Section type 1 (OBJECT_SETS)
    /* 00 */ le_uint16_t base_type = 0;
    /* 02 */ le_uint16_t set_flags = 0; // Used by PSO at runtime, unused in DAT file
    /* 04 */ le_uint16_t index = 0; // Used by PSO at runtime, unused in DAT file
    /* 06 */ le_uint16_t unknown_a2 = 0;
    /* 08 */ le_uint16_t entity_id = 0; // == index + 0x4000; used by PSO at runtime, unused in DAT file
    /* 0A */ le_uint16_t group = 0;
    /* 0C */ le_uint16_t section = 0;
    /* 0E */ le_uint16_t unknown_a3 = 0;
    /* 10 */ VectorXYZF pos;
    /* 1C */ VectorXYZI angle;
    /* 28 */ le_float param1 = 0.0f; // Boxes: if <= 0, this is a specialized box, and the specialization is in param4/5/6
    /* 2C */ le_float param2 = 0.0f;
    /* 30 */ le_float param3 = 0.0f; // Boxes: if == 0, the item should be varied by difficulty and area
    /* 34 */ le_uint32_t param4 = 0;
    /* 38 */ le_uint32_t param5 = 0;
    /* 3C */ le_uint32_t param6 = 0;
    /* 40 */ le_uint32_t unused = 0; // Reserved for pointer in client's memory; unused by server
    /* 44 */

    uint64_t semantic_hash() const;
    std::string str() const;
  } __packed_ws__(ObjectSetEntry, 0x44);

  struct EnemySetEntry { // Section type 2 (ENEMY_SETS)
    /* 00 */ le_uint16_t base_type = 0;
    /* 02 */ le_uint16_t set_flags = 0; // Used by PSO at runtime, unused in DAT file
    /* 04 */ le_uint16_t index = 0; // Used by PSO at runtime, unused in DAT file
    /* 06 */ le_uint16_t num_children = 0; // If == 0, use the default child count from the constructor table (which is often also 0)
    /* 08 */ le_uint16_t floor = 0;
    /* 0A */ le_uint16_t entity_id = 0; // == index + 0x1000; used by PSO at runtime, unused in DAT file
    /* 0C */ le_uint16_t section = 0;
    /* 0E */ le_uint16_t wave_number = 0;
    /* 10 */ le_uint16_t wave_number2 = 0;
    /* 12 */ le_uint16_t unknown_a1 = 0;
    /* 14 */ VectorXYZF pos;
    /* 24 */ VectorXYZI angle;
    /* 2C */ le_float fparam1 = 0.0f;
    /* 30 */ le_float fparam2 = 0.0f;
    /* 34 */ le_float fparam3 = 0.0f;
    /* 38 */ le_float fparam4 = 0.0f;
    /* 3C */ le_float fparam5 = 0.0f;
    /* 40 */ le_uint16_t uparam1 = 0;
    /* 42 */ le_uint16_t uparam2 = 0;
    /* 44 */ le_uint32_t unused = 0; // Reserved for pointer in client's memory; unused by server
    /* 48 */

    uint64_t semantic_hash() const;
    std::string str() const;
  } __packed_ws__(EnemySetEntry, 0x48);

  struct EventsSectionHeader { // Section type 3 (EVENTS)
    /* 00 */ le_uint32_t action_stream_offset;
    /* 04 */ le_uint32_t entries_offset;
    /* 08 */ le_uint32_t entry_count;
    /* 0C */ be_uint32_t format; // 0 or 'evt2'
    /* 10 */

    inline bool is_evt2() const {
      return (this->format == 0x65767432);
    }
  } __packed_ws__(EventsSectionHeader, 0x10);

  struct Event1Entry { // Section type 3 (EVENTS) if format == 0
    /* 00 */ le_uint32_t event_id = 0;
    // Bits in flags:
    //   0004 = is active
    //   0008 = post-wave actions have been run
    //   0010 = all enemies killed
    /* 04 */ le_uint16_t flags = 0; // Used by PSO at runtime, unused in DAT file
    /* 06 */ le_uint16_t event_type = 0;
    /* 08 */ le_uint16_t section = 0;
    /* 0A */ le_uint16_t wave_number = 0;
    /* 0C */ le_uint32_t delay = 0;
    /* 10 */ le_uint32_t action_stream_offset = 0;
    /* 14 */

    uint64_t semantic_hash() const;
    std::string str() const;
  } __packed_ws__(Event1Entry, 0x14);

  struct Event2Entry { // Section type 3 (EVENTS) if format == 'evt2'
    /* 00 */ le_uint32_t event_id = 0;
    /* 04 */ le_uint16_t flags = 0; // Used by PSO at runtime, unused in DAT file
    /* 06 */ le_uint16_t event_type = 0;
    /* 08 */ le_uint16_t section = 0;
    /* 0A */ le_uint16_t wave_number = 0;
    /* 0C */ le_uint16_t min_delay = 0;
    /* 0E */ le_uint16_t max_delay = 0;
    /* 10 */ uint8_t min_enemies = 0;
    /* 11 */ uint8_t max_enemies = 0;
    /* 12 */ le_uint16_t max_waves = 0;
    /* 14 */ le_uint32_t action_stream_offset = 0;
    /* 18 */

    std::string str() const;
  } __packed_ws__(Event2Entry, 0x18);

  struct RandomEnemyLocationsHeader { // Section type 4 (RANDOM_ENEMY_LOCATIONS)
    /* 00 */ le_uint32_t section_table_offset; // Offset to RandomEnemyLocationSegment structs, from start of this struct
    /* 04 */ le_uint32_t entries_offset; // Offset to RandomEnemyLocationEntry structs, from start of this struct
    /* 08 */ le_uint32_t num_sections;
    /* 0C */
  } __packed_ws__(RandomEnemyLocationsHeader, 0x0C);

  struct RandomEnemyLocationSection { // Section type 4 (RANDOM_ENEMY_LOCATIONS)
    /* 00 */ le_uint16_t section;
    /* 02 */ le_uint16_t count;
    /* 04 */ le_uint32_t offset;
    /* 08 */
  } __packed_ws__(RandomEnemyLocationSection, 8);

  struct RandomEnemyLocationEntry { // Section type 4 (RANDOM_ENEMY_LOCATIONS)
    /* 00 */ VectorXYZF pos;
    /* 0C */ VectorXYZI angle;
    /* 18 */ le_uint16_t unknown_a9; // TODO: Verify these are actually little-endian
    /* 1A */ le_uint16_t unknown_a10; // TODO: Verify these are actually little-endian
    /* 1C */

    std::string str() const;
  } __packed_ws__(RandomEnemyLocationEntry, 0x1C);

  struct RandomEnemyDefinitionsHeader { // Section type 5 (RANDOM_ENEMY_DEFINITIONS)
    /* 00 */ le_uint32_t entries_offset; // Offset to RandomEnemyDefinition structs, from start of this struct
    /* 04 */ le_uint32_t weight_entries_offset; // Offset to RandomEnemyDefinitionWeights structs, from start of this struct
    /* 08 */ le_uint32_t entry_count;
    /* 0C */ le_uint32_t weight_entry_count;
    /* 10 */
  } __packed_ws__(RandomEnemyDefinitionsHeader, 0x10);

  struct RandomEnemyDefinition { // Section type 5 (RANDOM_ENEMY_DEFINITIONS)
    // All fields through entry_num map to the corresponding fields in
    // EnemySetEntry. Note that the order of the uparam fields is switched!
    /* 00 */ le_float fparam1;
    /* 04 */ le_float fparam2;
    /* 08 */ le_float fparam3;
    /* 0C */ le_float fparam4;
    /* 10 */ le_float fparam5;
    /* 14 */ le_uint16_t uparam2;
    /* 16 */ le_uint16_t uparam1;
    /* 18 */ le_uint32_t entry_num;
    /* 1C */ le_uint16_t min_children;
    /* 1E */ le_uint16_t max_children;
    /* 20 */

    std::string str() const;
  } __packed_ws__(RandomEnemyDefinition, 0x20);

  struct RandomEnemyWeight { // Section type 5 (RANDOM_ENEMY_DEFINITIONS)
    /* 00 */ uint8_t base_type_index;
    /* 01 */ uint8_t def_entry_num;
    /* 02 */ uint8_t weight;
    /* 03 */ uint8_t unknown_a4;
    /* 04 */

    std::string str() const;
  } __packed_ws__(RandomEnemyWeight, 4);

  struct RandomState {
    PSOV2Encryption random;
    PSOV2Encryption location_table_random;
    std::array<uint32_t, 0x20> location_index_table;
    uint32_t location_indexes_populated;
    uint32_t location_indexes_used;
    uint32_t location_entries_base_offset;

    RandomState(uint32_t random_seed);
    size_t rand_int_biased(size_t min_v, size_t max_v);
    uint32_t next_location_index();
    void generate_shuffled_location_table(const RandomEnemyLocationsHeader& header, phosg::StringReader r, uint16_t section);
  };

  struct FloorSections {
    const ObjectSetEntry* object_sets = nullptr;
    size_t object_set_count = 0;
    size_t first_object_set_index = 0;

    const EnemySetEntry* enemy_sets = nullptr;
    size_t enemy_set_count = 0;
    size_t first_enemy_set_index = 0;

    const void* events_data = nullptr;
    size_t events_data_size = 0;
